tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
#include "IrrigationApp.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <Wire.h>

#include <climits>
#include <cstdio>
#include <cstring>

#include "BoardHardware.h"
#include "BoardPins.h"
#include "IrrigationRecords.h"
#include "IrrigationPlatform.h"
#include "IrrigationWeb.h"

namespace {

constexpr const char* kFirmwareName = "esp32-irrigation";
constexpr const char* kFirmwareVersion = "0.9.0";
constexpr const char* kDefaultWebUser = "admin";
constexpr const char* kDefaultWebPassword = "admin";

struct LatestTrustedEpoch {
    uint32_t value = 0;
};

void collectWateringEpoch(const StoredWateringRecord& record, void* user) {
    auto* latest = static_cast<LatestTrustedEpoch*>(user);
    if (latest && record.payload.startedEpoch > latest->value) latest->value = record.payload.startedEpoch;
    uint32_t epoch = 0;
    if (latest && Esp32BaseRecordStore::resolveCompletedEpoch(record.timing, epoch) &&
        epoch > latest->value) {
        latest->value = epoch;
    }
}

void collectEventEpoch(const IrrigationEvents::EventRecord& event, void* user) {
    auto* latest = static_cast<LatestTrustedEpoch*>(user);
    uint32_t epoch = 0;
    if (latest && Esp32BaseRecordStore::resolveCompletedEpoch(event.timing, epoch) &&
        epoch > latest->value) {
        latest->value = epoch;
    }
}

bool failStartup(BoardHardware& hardware, StatusIndicator& indicator) {
    hardware.safeShutdown();
    const uint32_t nowMs = millis();
    indicator.setMode(StatusIndicator::Mode::Critical, nowMs);
    indicator.handle(nowMs);
    return false;
}

}  // namespace

IrrigationApp::IrrigationApp()
    : statusIndicator_(StatusIndicator::instance()) {}

IrrigationApp& IrrigationApp::instance() {
    static IrrigationApp app;
    return app;
}

bool IrrigationApp::begin() {
    if (started_) {
        return baseReady_;
    }
    started_ = true;

    // This must remain the first hardware operation of application startup.
    BoardHardware& hardware = BoardHardware::instance();
    const bool hardwareReady = hardware.begin(20000);
    statusIndicator_.begin(millis());

    Serial.begin(115200);
    if (!hardwareReady) {
        return failStartup(hardware, statusIndicator_);
    }

    Wire.begin(BoardPins::kI2cSdaPin, BoardPins::kI2cSclPin);
    IrrigationRecords::instance().bind(wateringRecordStore_, events_.auditStore());
    Esp32Base::setFirmwareInfo(kFirmwareName, kFirmwareVersion);
    Esp32BaseRtc::configure(Wire);
    Esp32BaseOta::setUploadGuard(allowOta, this);
    Esp32BaseStorage::setFormatGuard(allowMaintenance, this);
    Esp32Base::setBeforeLifecycleStopCallback(beforeLifecycleStop, this);
    Esp32BaseWeb::setDefaultAuth(kDefaultWebUser, kDefaultWebPassword);
    Esp32BaseWeb::setAfterFormatFsCallback(afterFormatFs, this);
    if (!IrrigationParameterConfig::registerFields(parameterConfigSaved,
                                                   validateParameterConfig,
                                                   this) ||
        !IrrigationWeb::registerRoutes(*this)) {
        return failStartup(hardware, statusIndicator_);
    }
    Esp32BaseAppConfig::setApplyStatusCallback(parameterApplyStatus);
    // Peripheral MQTT adapter claims Base MQTT before begin; absent
    // provisioning safely leaves the device local-only.
    IrrigationPlatform::configure();
    baseReady_ = Esp32Base::begin();
    if (!baseReady_) {
        return failStartup(hardware, statusIndicator_);
    }
    Esp32BaseWiFi::setPowerSave(true);
    if (!configStore_.begin()) {
        return failStartup(hardware, statusIndicator_);
    }

    if (!applyStoredParameterConfig()) {
        return failStartup(hardware, statusIndicator_);
    }

    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return failStartup(hardware, statusIndicator_);
    }

    if (!wateringController_.begin(config->valveDrive.pwmFrequencyHz)) {
        return failStartup(hardware, statusIndicator_);
    }

    const bool wateringStoreReady = wateringRecordStore_.begin();
    const bool auditStoreReady = events_.begin();
    const bool recordsRegistered = IrrigationRecords::instance().begin(
        wateringRecordStore_, events_.auditStore());
    const bool recordsReady = wateringStoreReady && auditStoreReady && recordsRegistered;
    // Availability is queried per store; this flag only tracks failed results.
    recordStorageFault_ = false;
    if (!recordsReady) {
        ESP32BASE_LOG_E("irrigation",
                        "business_record_stores_begin_failed watering=%s audit=%s",
                        wateringStoreReady ? "ready" : "failed",
                        auditStoreReady ? "ready" : "failed");
    } else {
        Esp32BaseRecordStore::StoreStatus wateringStatus;
        Esp32BaseRecordStore::StoreStatus auditStatus;
        wateringRecordStore_.readStatus(wateringStatus);
        events_.auditStore().readStatus(auditStatus);
        ESP32BASE_LOG_I("irrigation",
                        "business_record_stores_ready watering_capacity=%lu watering_slot=%lu audit_capacity=%lu audit_slot=%lu",
                        static_cast<unsigned long>(wateringStatus.capacity),
                        static_cast<unsigned long>(wateringStatus.slotSizeBytes),
                        static_cast<unsigned long>(auditStatus.capacity),
                        static_cast<unsigned long>(auditStatus.slotSizeBytes));
    }

    schedulerStorageFault_ = !wateringScheduler_.begin(wateringSchedulerStore_);
    wateringScheduler_.setCallbacks(startScheduledWatering, handleSchedulerEvent, this);
    if (schedulerStorageFault_) {
        ESP32BASE_LOG_E("irrigation", "watering_scheduler_store_unavailable");
    }
    aliveCheckpoint_.begin();
    LatestTrustedEpoch latestTrusted;
    latestTrusted.value = aliveCheckpoint_.lastKnownAliveEpoch();
    wateringRecordStore_.readLatest(0, 1, collectWateringEpoch, &latestTrusted);
    events_.readLatest(0, 1, collectEventEpoch, &latestTrusted);
    wateringScheduler_.setTrustedEpochBaseline(latestTrusted.value);

