tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
    businessReady_ = true;
    const uint32_t readyMs = millis();
    resetUnexpectedFlowMonitor(readyMs);
    updateStatusIndicator(readyMs);
    ESP32BASE_LOG_I("irrigation", "business_ready records_fault=%s events_fault=%s scheduler_fault=%s",
                    recordStorageFault_ ? "yes" : "no",
                    events_.storageFault() ? "yes" : "no",
                    schedulerStorageFault_ ? "yes" : "no");
    IrrigationPlatform::bindStores(wateringRecordStore_, events_.auditStore());
    IrrigationPlatform::begin();
    return true;
}

void IrrigationApp::handle() {
    const uint32_t nowMs = millis();
    if (!started_ || !baseReady_) {
        wateringController_.safeShutdown();
        statusIndicator_.setMode(StatusIndicator::Mode::Critical, nowMs);
        statusIndicator_.handle(nowMs);
        return;
    }

    if (Esp32BaseOta::isUploading() || Esp32BaseOta::status() == Esp32BaseOta::SUCCESS) {
        wateringController_.safeShutdown();
        Esp32Base::handle();
        return;
    }
    IrrigationRecords::instance().handle(millis());
    advanceBusiness();
    updateStatusIndicator(nowMs);
    Esp32Base::handle();
    IrrigationPlatform::poll();
}

bool IrrigationApp::baseReady() const {
    return baseReady_;
}

bool IrrigationApp::businessReady() const {
    return businessReady_;
}

WateringStartResult IrrigationApp::startWatering(const WateringRequest& request) {
    if (Esp32BaseOta::isUploading() || Esp32BaseOta::status() == Esp32BaseOta::SUCCESS) {
        return WateringStartResult::Busy;
    }
    if (!businessReady_) {
        return WateringStartResult::NotReady;
    }
    if (wateringController_.active()) {
        return WateringStartResult::Busy;
    }
    if (wateringController_.finishedSession()) {
        return WateringStartResult::PreviousResultPending;
    }
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return WateringStartResult::NotReady;
    }

    if (request.purpose == WateringPurpose::Normal) {
        const auto& records = IrrigationRecords::instance();
        if (!records.writable(IrrigationRecords::StoreKind::Watering))
            return WateringStartResult::NotReady;
    }
    if (!WateringController::isValidRequest(request, *config)) return WateringStartResult::InvalidRequest;
    const bool normal = request.purpose == WateringPurpose::Normal;
    Esp32BaseRecordStore::RecordStartTime startTime{};
    const bool captured = wateringRecordStore_.captureStartTime(startTime);
    if (normal && (!captured || !wateringRecordStore_.prepareTask(request)))
        return WateringStartResult::NotReady;
    const WateringStartResult result = wateringController_.start(request, *config, millis());
    if (result == WateringStartResult::Started || wateringController_.finishedSession()) {
        wateringStartTime_ = startTime;
        wateringStartTimeValid_ = captured;
    }
    if (wateringController_.finishedSession()) return WateringStartResult::Started;
    if (normal && result != WateringStartResult::Started) wateringRecordStore_.cancelPreparedTask();
    return result;
}

bool IrrigationApp::stopWatering() {
    return businessReady_ && wateringController_.stop(millis());
}

WateringStatus IrrigationApp::wateringStatus() const {
    return wateringController_.status();
}

FlowHistorySnapshot IrrigationApp::wateringFlowHistory() const {
    return wateringController_.flowHistory();
}

bool IrrigationApp::readLatestWateringRecords(uint32_t offset,
                                              uint32_t limit,
                                              WateringRecordStore::ReadCallback callback,
                                              void* user) {
    return wateringRecordStore_.readLatest(offset, limit, callback, user);
}

Esp32BaseRecordStore::RecordReadResult IrrigationApp::readWateringRecordById(
    uint32_t recordId,
    StoredWateringRecord& record) {
    return wateringRecordStore_.readById(recordId, record);
}

bool IrrigationApp::readWateringRecordStoreStatus(
    Esp32BaseRecordStore::StoreStatus& status) const {
    return wateringRecordStore_.readStatus(status);
}

bool IrrigationApp::readLatestEvents(uint32_t offset,
                                     uint32_t limit,
                                     IrrigationEvents::ReadCallback callback,
                                     void* user) const {
    return events_.readLatest(offset, limit, callback, user);
}

bool IrrigationApp::readEventStatus(IrrigationEvents::EventStatus& status) const {
    return events_.readStatus(status);
}

IrrigationEvents::ConditionDisplayState IrrigationApp::eventConditionState(
    uint8_t conditionId) const {
    return events_.conditionState(conditionId);
}

bool IrrigationApp::recordStorageFault() const {
    return recordStorageFault_ ||
           !IrrigationRecords::instance().writable(IrrigationRecords::StoreKind::Watering);
}

bool IrrigationApp::eventStorageFault() const {
    return events_.storageFault();
}

bool IrrigationApp::schedulerStorageFault() const {
    return schedulerStorageFault_;
}

bool IrrigationApp::checkpointStorageFault() const {
    return aliveCheckpoint_.storageFault();
}

uint32_t IrrigationApp::lastKnownAliveEpoch() const {
    return aliveCheckpoint_.lastKnownAliveEpoch();
}

bool IrrigationApp::unexpectedFlowAlarm() const {
    return unexpectedFlowMonitor_.alarmActive();
}

bool IrrigationApp::unexpectedFlowObservationReady() const {
    return unexpectedFlowMonitor_.observationReady(millis());
}

uint16_t IrrigationApp::unexpectedFlowDelayRemainingSec() const {
    return unexpectedFlowMonitor_.delayRemainingSec(millis());
}

uint16_t IrrigationApp::unexpectedFlowWindowRemainingSec() const {
    return unexpectedFlowMonitor_.windowRemainingSec(millis());
}

uint16_t IrrigationApp::unexpectedFlowObservedWindowSec() const {
    const uint32_t durationMs =
        unexpectedFlowMonitor_.observedDurationMs(millis());
    return durationMs == 0
               ? 0
               : static_cast<uint16_t>((durationMs + 999U) / 1000U);
}

uint32_t IrrigationApp::unexpectedFlowObservedPulseCount() const {
    return unexpectedFlowMonitor_.observedPulseCount();
}

uint32_t IrrigationApp::unexpectedFlowEstimatedMlPerMinute() const {
    const IrrigationConfig* config = configStore_.current();
    const uint32_t durationMs =
        unexpectedFlowMonitor_.observedDurationMs(millis());
    const uint32_t pulseCount = unexpectedFlowMonitor_.observedPulseCount();
    if (!config || durationMs == 0 || pulseCount == 0) return 0;
    const uint64_t rate =
        (static_cast<uint64_t>(pulseCount) * 100000ULL +
         durationMs / 2U) /
        durationMs;
    uint32_t flowMlPerMinute = 0;
    FlowMonitor::pulseRateToFlowMlPerMinute(
        rate > UINT32_MAX ? UINT32_MAX : static_cast<uint32_t>(rate),
        config->flowMeter.pulsesPerLiterX100,
        flowMlPerMinute);
    return flowMlPerMinute;
}

AutomaticWateringState IrrigationApp::automaticWateringState() const {
    return wateringScheduler_.automaticState();
}

NextAutomaticWatering IrrigationApp::nextAutomaticWatering() const {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return {NextAutomaticWateringStatus::TimeUnavailable, 0, 0};
    }
    return wateringScheduler_.nextAutomaticWatering(
        *config, Esp32BaseTime::snapshot().epochSec);
}

