tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
WateringScheduler::TimeState IrrigationApp::schedulerTimeState() const {
    return wateringScheduler_.timeState();
}

bool IrrigationApp::pauseAutomaticWateringIndefinitely() {
    return businessReady_ && wateringScheduler_.pauseIndefinitely();
}

bool IrrigationApp::pauseAutomaticWateringUntil(uint32_t resumeAtEpoch) {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return businessReady_ && wateringScheduler_.pauseUntil(resumeAtEpoch,
                                                           now.synced &&
                                                               wateringScheduler_.timeState() ==
                                                                   WateringScheduler::TimeState::Ready,
                                                           now.epochSec);
}

bool IrrigationApp::resumeAutomaticWatering() {
    return businessReady_ && IrrigationRecords::instance().writable(IrrigationRecords::StoreKind::Audit) &&
           wateringScheduler_.resumeManually();
}

WateringStartResult IrrigationApp::startZoneFlowLearning(uint8_t zoneId) {
    if (pendingLearnedZoneId_ != 0 || !BoardPins::isValidZoneId(zoneId)) {
        return WateringStartResult::InvalidRequest;
    }
    WateringRequest request{};
    request.source = WateringSource::LocalWeb;
    request.purpose = WateringPurpose::ZoneFlowLearning;
    request.stepCount = 1;
    request.steps[0] = {zoneId, 10U * 60U};
    return startWatering(request);
}

bool IrrigationApp::saveLearnedZoneFlow(uint32_t expectedConfigRevision) {
    if (!BoardPins::isValidZoneId(pendingLearnedZoneId_) ||
        pendingLearnedBaselinePulseRateX10000_ == 0) {
        return false;
    }
    if (!saveZoneBaselinePulseRate(pendingLearnedZoneId_,
                                   pendingLearnedBaselinePulseRateX10000_,
                                   expectedConfigRevision)) {
        return false;
    }
    discardLearnedZoneFlow();
    return true;
}

bool IrrigationApp::saveManualZoneBaselineFlow(
    uint8_t zoneId,
    uint32_t flowMlPerMinute,
    uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!current || pendingLearnedZoneId_ != 0 ||
        flowMlPerMinute == 0 || flowMlPerMinute > 100000U) {
        return false;
    }
    uint32_t pulseRateX10000 = 0;
    if (!FlowMonitor::flowMlPerMinuteToPulseRateX10000(
            flowMlPerMinute,
            current->flowMeter.pulsesPerLiterX100,
            pulseRateX10000)) {
        return false;
    }
    uint32_t verifiedFlowMlPerMinute = 0;
    if (!FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
            pulseRateX10000,
            current->flowMeter.pulsesPerLiterX100,
            verifiedFlowMlPerMinute) ||
        verifiedFlowMlPerMinute != flowMlPerMinute) {
        return false;
    }
    return saveZoneBaselinePulseRate(
        zoneId, pulseRateX10000, expectedConfigRevision);
}

bool IrrigationApp::saveZoneBaselinePulseRate(
    uint8_t zoneId,
    uint32_t pulseRateX10000,
    uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.active() || !current ||
        !BoardPins::isValidZoneId(zoneId) || pulseRateX10000 == 0) {
        return false;
    }
    if (!IrrigationRecords::instance().writable(IrrigationRecords::StoreKind::Audit)) return false;
    IrrigationConfig next = *current;
    const uint32_t previousPulseRateX10000 =
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000;
    next.zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 =
        pulseRateX10000;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    uint32_t savedFlowMlPerMinute = 0;
    uint32_t previousFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        previousPulseRateX10000,
        next.flowMeter.pulsesPerLiterX100,
        previousFlowMlPerMinute);
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        pulseRateX10000,
        next.flowMeter.pulsesPerLiterX100,
        savedFlowMlPerMinute);
    events_.recordZoneFlowSaved(zoneId,
                                previousFlowMlPerMinute,
                                pulseRateX10000,
                                savedFlowMlPerMinute);
    return true;
}

uint8_t IrrigationApp::pendingLearnedZoneId() const {
    return pendingLearnedZoneId_;
}

uint32_t IrrigationApp::pendingLearnedBaselinePulseRateX10000() const {
    return pendingLearnedBaselinePulseRateX10000_;
}

uint32_t IrrigationApp::pendingLearnedFlowMlPerMinute() const {
    const IrrigationConfig* current = configStore_.current();
    uint32_t flowMlPerMinute = 0;
    if (current) {
        FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
            pendingLearnedBaselinePulseRateX10000_,
            current->flowMeter.pulsesPerLiterX100,
            flowMlPerMinute);
    }
    return flowMlPerMinute;
}

bool IrrigationApp::clearLearnedZoneFlow(uint8_t zoneId,
                                         uint32_t expectedConfigRevision) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || wateringController_.active() || !current ||
        pendingLearnedZoneId_ != 0 ||
        !BoardPins::isValidZoneId(zoneId) ||
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 == 0) {
        return false;
    }
    if (!IrrigationRecords::instance().writable(IrrigationRecords::StoreKind::Audit)) return false;
    IrrigationConfig next = *current;
    uint32_t previousFlowMlPerMinute = 0;
    FlowMonitor::pulseRateX10000ToFlowMlPerMinute(
        current->zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000,
        current->flowMeter.pulsesPerLiterX100,
        previousFlowMlPerMinute);
    next.zones[BoardPins::zoneIndex(zoneId)].baselinePulseRateX10000 = 0;
    if (!configStore_.save(next, expectedConfigRevision)) {
        return false;
    }
    wateringScheduler_.rebaseTimeCheck();
    events_.recordZoneFlowSaved(zoneId, previousFlowMlPerMinute, 0, 0);
    return true;
}

void IrrigationApp::discardLearnedZoneFlow() {
    if (!wateringController_.active()) {
        pendingLearnedZoneId_ = 0;
        pendingLearnedBaselinePulseRateX10000_ = 0;
    }
}

const IrrigationConfig* IrrigationApp::configuration() const {
    return configStore_.current();
}

