tangyangguang/Esp32_Irrigation/firmware/src/irrigation/IrrigationApp.cpp
IrrigationConfigStore::LoadResult IrrigationApp::configurationLoadResult() const {
    return configStore_.loadResult();
}

bool IrrigationApp::saveConfiguration(const IrrigationConfig& proposed,
                                      uint32_t expectedRevision,
                                      IrrigationEvents::ConfigurationChange change,
                                      uint8_t objectId) {
    const IrrigationConfig* current = configStore_.current();
    if (!businessReady_ || !current) {
        return false;
    }
    const bool audited = change == IrrigationEvents::ConfigurationChange::PlanCreated ||
                         change == IrrigationEvents::ConfigurationChange::PlanUpdated ||
                         change == IrrigationEvents::ConfigurationChange::PlanDeleted;
    if (audited && !IrrigationRecords::instance().writable(IrrigationRecords::StoreKind::Audit)) return false;
    const bool active = wateringController_.active();
    if (!configStore_.save(proposed, expectedRevision)) return false;
    wateringScheduler_.rebaseTimeCheck();
    if (!active) {
        resetUnexpectedFlowMonitor(millis());
    }
    events_.recordConfigurationChanged(change, objectId, configStore_.current());
    return true;
}

const char* IrrigationApp::configurationError() const {
    return configStore_.lastError();
}

void IrrigationApp::advanceBusiness() {
    if (!businessReady_) {
        wateringController_.safeShutdown();
        consumeFinishedWatering(millis());
        return;
    }
    const uint32_t nowMs = millis();
    if (!eventConditionsInitialized_) {
        refreshRtcCondition(nowMs, true);
        eventConditionsInitialized_ = true;
    }
    refreshRtcCondition(nowMs, false);
    // A deferred hardware change may fail immediately after execution ends.
    // Its completed fact must still reach storage while new starts are blocked.
    consumeFinishedWatering(nowMs);
    if (!wateringController_.hardwareReady()) {
        businessReady_ = false;
        wateringController_.safeShutdown();
        return;
    }
    const IrrigationConfig* config = configStore_.current();
    if (config && !wateringController_.active()) {
        unexpectedFlowMonitor_.observe(nowMs, BoardHardware::instance().flowPulseCount());
    }
    if (config) {
        const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
        if (wateringScheduler_.storageReady()) {
            wateringScheduler_.handle(*config,
                                      now.synced,
                                      now.source == Esp32BaseTime::SOURCE_NTP,
                                      now.epochSec);
        }
        observeEventConditions(nowMs, now);
        Esp32BaseRecordStore::StoreStatus recordStatus{};
        IrrigationEvents::EventStatus eventStatus{};
        if (wateringRecordStore_.readStatus(recordStatus) &&
            events_.readStatus(eventStatus)) {
            const uint64_t activitySequence =
                (static_cast<uint64_t>(recordStatus.nextRecordId) << 32U) |
                eventStatus.eventStore.nextRecordId;
            aliveCheckpoint_.handle(now,
                                    config->timeSafety.aliveCheckpointHours,
                                    wateringController_.active(),
                                    activitySequence);
        }
    }
}

void IrrigationApp::consumeFinishedWatering(uint32_t nowMs) {
    const WateringSessionSummary* summary = wateringController_.finishedSession();
    if (!summary) {
        return;
    }

    if (summary->purpose == WateringPurpose::ZoneFlowLearning &&
               summary->zoneCount == 1 &&
               summary->zones[0].suggestedBaselinePulseRateX10000 != 0) {
        pendingLearnedZoneId_ = summary->zones[0].zoneId;
        pendingLearnedBaselinePulseRateX10000_ =
            summary->zones[0].suggestedBaselinePulseRateX10000;
    }

    if (summary->purpose == WateringPurpose::Normal) {
        if (!finishedWateringStored_) {
            finishedWateringStored_ = wateringStartTimeValid_ &&
                wateringRecordStore_.appendCompleted(
                    wateringStartTime_, *summary);
        }
        recordStorageFault_ = !finishedWateringStored_ ||
            !IrrigationRecords::instance().writable(
                IrrigationRecords::StoreKind::Watering);
        if (!finishedWateringStored_ || !wateringRecordStore_.cancelPreparedTask()) return;
        recordStorageFault_ = false;
    }

    resetUnexpectedFlowMonitor(nowMs);
    wateringController_.clearFinishedSession();
    finishedWateringStored_ = false;
    wateringStartTime_ = {};
    wateringStartTimeValid_ = false;
}

uint32_t IrrigationApp::trustedEpoch() const {
    const Esp32BaseTime::Snapshot now = Esp32BaseTime::snapshot();
    return now.synced ? now.epochSec : 0;
}

void IrrigationApp::updateStatusIndicator(uint32_t nowMs) {
    StatusIndicator::Mode mode = StatusIndicator::Mode::ReadyIdle;
    if (!businessReady_ || recordStorageFault() || eventStorageFault() ||
        schedulerStorageFault_ || checkpointStorageFault() || unexpectedFlowAlarm()) {
        mode = StatusIndicator::Mode::Critical;
    } else if (wateringController_.active()) {
        mode = StatusIndicator::Mode::Active;
    }
    statusIndicator_.setMode(mode, nowMs);
    statusIndicator_.handle(nowMs);
}

Esp32BaseAppConfig::ApplyStatus IrrigationApp::parameterApplyStatus() {
    const auto& app = instance();
    if (!app.businessReady_ || !app.wateringController_.hardwareReady())
        return Esp32BaseAppConfig::ApplyStatus::Failed;
    return app.wateringController_.parametersPending()
        ? Esp32BaseAppConfig::ApplyStatus::Pending : Esp32BaseAppConfig::ApplyStatus::Applied;
}

void IrrigationApp::parameterConfigSaved(void* user) {
    if (user) static_cast<IrrigationApp*>(user)->handleParameterConfigSaved();
}

bool IrrigationApp::applyStoredParameterConfig() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return false;
    parameterConfigScratch_ = *current;
    return IrrigationParameterConfig::applyStored(parameterConfigScratch_) &&
           configStore_.applyRuntimeParameters(parameterConfigScratch_);
}

bool IrrigationApp::validateParameterConfig(const IrrigationParameters& proposed,
                                            char* error,
                                            size_t errorLength,
                                            void* user) {
    const auto* app = static_cast<IrrigationApp*>(user);
    const IrrigationConfig* current = app ? app->configStore_.current() : nullptr;
    if (!current) return true;
    for (const WateringPlan& plan : current->plans) {
        if (!plan.configured) continue;
        for (uint8_t zoneIndex = 0; zoneIndex < plan.zoneDurationMinutes.size(); ++zoneIndex) {
            if (plan.zoneDurationMinutes[zoneIndex] >
                proposed.runLimits.maximumZoneDurationMinutes) {
                std::snprintf(error,
                              errorLength,
                              "计划“%s”的水路 %u 为 %u 分钟，请先调整计划。",
                              plan.name.data(),
                              static_cast<unsigned>(zoneIndex + 1U),
                              static_cast<unsigned>(plan.zoneDurationMinutes[zoneIndex]));
                return false;
            }
        }
    }
    return true;
}

void IrrigationApp::handleParameterConfigSaved() {
    const IrrigationConfig* current = configStore_.current();
    if (!current) return;
    parameterConfigScratch_ = *current;
    if (!IrrigationParameterConfig::applyStored(parameterConfigScratch_)) {
        businessReady_ = false;
        wateringController_.safeShutdown();
        return;
    }
    const bool active = wateringController_.active();
    if (!configStore_.applyRuntimeParameters(parameterConfigScratch_) ||
        !wateringController_.configureValvePwmFrequency(parameterConfigScratch_.valveDrive.pwmFrequencyHz)) {
        businessReady_ = false;
        wateringController_.safeShutdown();
        return;
    }
    wateringScheduler_.rebaseTimeCheck();
    if (!active) resetUnexpectedFlowMonitor(millis());
    events_.recordConfigurationChanged(
        IrrigationEvents::ConfigurationChange::SystemParametersUpdated,
        0,
        configStore_.current());
}

void IrrigationApp::resetUnexpectedFlowMonitor(uint32_t nowMs) {
    const IrrigationConfig* config = configStore_.current();
    if (!config) {
        return;
    }
    unexpectedFlowMonitor_.begin(
        nowMs,
        BoardHardware::instance().flowPulseCount(),
        config->flowProtection.unexpectedFlowDelaySec,
        config->flowProtection.unexpectedFlowWindowSec,
        config->flowProtection.unexpectedFlowPulseCount);
    events_.observeClosedValveFlow(Esp32BaseConditions::ObservedState::Unknown,
                                   0,
                                   0,
                                   config->flowProtection.unexpectedFlowWindowSec,
                                   config->flowProtection.unexpectedFlowPulseCount);
}

